//=====================================================
//
// バリアオブジェクトの管理処理 [ barriermanager.cpp ]
// Author : Asuma Nishio
// 
// TODO : これをゲームマネージャーで取得できるようにしてポインタを渡す
//
//=====================================================

//*********************************
// インクルードファイル
//*********************************
#include "barriermanager.h"

//============================
// コンストラクタ
//============================
CBarrierManager::CBarrierManager()
{

}
//============================
// デストラクタ
//============================
CBarrierManager::~CBarrierManager()
{

}
//============================
// 初期化処理
//============================
HRESULT CBarrierManager::Init(void)
{
	return S_OK;
}
//============================
// 終了処理
//============================
void CBarrierManager::Uninit(void)
{

}
//============================
// 更新処理
//============================
void CBarrierManager::Update(void)
{

}
