//====================================
//
// 編集用モデル処理 [ edimodel.cpp ]
// Author: Asuma Nishio
//
//=====================================

//**********************
// インクルードファイル
//**********************
#include "editmodel.h"

//=============================
// コンストラクタ
//=============================
CEditModel::CEditModel(int nPriority) : CObject(nPriority)
{

}
//=============================
// デストラクタ
//=============================
CEditModel::~CEditModel()
{

}
//=============================
// 生成
//=============================
CEditModel* CEditModel::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	return nullptr;
}
//=============================
// 初期化処理
//=============================
HRESULT CEditModel::Init(void)
{

	return S_OK;
}
//=============================
// 終了処理
//=============================
void CEditModel::Uninit(void)
{
	// 自身の破棄
	Release();
}
//=============================
// 更新処理
//=============================
void CEditModel::Update(void)
{

}
//=============================
// 描画処理
//=============================
void CEditModel::Draw(void)
{

}
