//============================================
//
// アイテム管理処理 [ itemmanager.cpp ]
// Author : Asuma Nishio
// 
// TODO : アイテムの生成,管理をする
//
//============================================

//*********************************
// インクルードファイル
//*********************************
#include "itemmanager.h"
#include "gamemanager.h"
#include "time.h"

//=================================
// コンストラクタ
//=================================
CItemManager::CItemManager()
{
	// 値のクリア
}
//=================================
// デストラクタ
//=================================
CItemManager::~CItemManager()
{
	// 無し
}
//=================================
// 初期化処理
//=================================
HRESULT CItemManager::Init(void)
{
	// 初期化結果を返す
	return S_OK;
}
//=================================
// 終了処理
//=================================
void CItemManager::Uninit(void)
{
	// 各種終了処理

}
//=================================
// 更新処理
//=================================
void CItemManager::Update(void)
{

}
