//=====================================
//
// ランキングシーン処理 [ ranking.cpp ]
// Author: Asuma Nishio
//
//=====================================

//******************************
// インクルードファイル宣言
//******************************
#include "ranking.h"
#include "manager.h"

//===================================
// オーバーロードコンストラクタ
//===================================
CRanking::CRanking() : CScene(CScene::MODE_RANKING)
{
	// 値のクリア
}
//===================================
// デストラクタ
//===================================
CRanking::~CRanking()
{
	// 無し
}
//===================================
// 初期化処理
//===================================
HRESULT CRanking::Init(void)
{
	return S_OK;
}
//===================================
// 終了処理
//===================================
void CRanking::Uninit(void)
{
	// nullチェック
}
//===================================
// 更新処理
//===================================
void CRanking::Update(void)
{

}
//===================================
// 描画処理
//===================================
void CRanking::Draw(void)
{

}
//===================================
// 生成処理
//===================================
CRanking* CRanking::Create(void)
{
	// インスタンス生成
	CRanking* pRanking = new CRanking;
	if (pRanking == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pRanking->Init()))
	{
		return nullptr;
	}

	// 生成されたポインタを返す
	return pRanking;
}
